from prettytable import PrettyTable
tab = PrettyTable()

tab.field_names = (["Найменування товару", "Код товару", "Ринок", "2007", "2008", "2011", "2017"])
tab.add_raws(
    [
        ["Картопля", "101", "Бесарабський", "0,74", "0,83", "2,08", "70"],
        ["Картопля", "101", "Лук'янівський", "0,7", "0,82", "2,04", "40"],
        ["Картопля", "101", "Сінний", "0,66", "0,75", "2,03", "39,8"],
        ["Капуста", "102", "Бесарабський", "0,38", "0,65", "2,4", "45"],
        ["Капуста", "102", "Лук'янівський", "0,36", "0,6", "2,3", "44,6"],
        ["Капуста", "102", "Сінний", "0,59", "0,75", "2,03", "69,5"],
        ["Цибуля", "103", "Бесарабський", "0,63", "0,79", "2,04", "40"],
        ["Цибуля", "103", "Лук'янівський", "0,63", "0,75", "2", "68"],
        ["Цибуля", "103", "Сінний", "0,36", "0,6", "2,35", "44,8"],
        ["Помідори", "201", "Бесарабський", "0,69", "0,99", "4,52", "30"],
        ["Помідори", "201", "Лук'янівський", "0,68", "0,98", "4,5", "29.6"],
        ["Помідори", "201", "Сінний", "0,69", "0,95", "4,45", "29.6"],
        ["Огірки", "202", "Бесарабський", "0,88", "1,24", "4,56", "25"],
        ["Огірки", "202", "Лук'янівський", "0,87", "1,22", "4,53", "25"],
        ["Огірки", "202", "Сінний", "0,85", "1,24", "4,55", "25"],
        ["Яблука", "203", "Бесарабський", "1", "1,33", "5,77", "70"],
        ["Яблука", "203", "Лук'янівський", "0,99", "1,31", "5,75", "68,9"],
        ["Яблука", "203", "Сінний", "0,99", "1,33", "5,75", "69"],
    ]
)
print(tab)